# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [2]:
# your answer here
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [4]:
# your answer here
temp.info()
# Tenemos dos columnas con datos 'texto' que son: City y State, mientras que 'Temperature' es un numero flotante

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 176.0+ bytes

#### Select the rows where state is New York

In [5]:
# your answer here
ny = temp[temp['State']=='New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average of the temperature of cities in New York?

In [6]:
# your answer here
ny['Temperature'].mean()

10.74074074074074

#### We want to know cities and states with Temperature above 15 degress Celcius

In [7]:
# your answer here
temp[temp['Temperature']>15.0]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [8]:
# your answer here
temp[temp['Temperature']>15.0]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [9]:
# your answer here
temp[(temp['Temperature']>15.0)&(temp['Temperature']<20.0)]['City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [10]:
# your answer here
#temp_state = pd.DataFrame(columns=['State','Temp_mean','Temp_std'])
temp_state = temp.groupby('State').agg(['mean',np.std]).reset_index()
temp_state
#df_summarize = data_frame_liquors.groupby(['item_description','category_name','county','date_mes_truncate']).agg({'bottles_sold':'sum','sale_usd':'sum','state_bottle_cost':'mean','state_bottle_retail':'mean'}).reset_index()

         State Temperature
                      mean       std
0  Connecticut   15.833333  1.964186
1   New Jersey   21.111111  1.571348
2     New York   10.740741  8.133404

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [11]:
# your answer here
employee = pd.read_csv('Employee.csv')
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the Temp dataframe. Comment your results

In [12]:
# your answer here
employee.info()

# tenemos la mayor parte de los datos como 'objeto' y tambien tenemos dos columnas con datos flotantes, que son: 'Years' y 'Salario'
# LÂ¿Se deberia de cambiar la de 'Years' a formato int para evitar errores

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 388.0+ bytes

#### Show visually the frequency distribution (histogram) of the employee dataset. In few words describe these histograms?

In [13]:
# your answer here
#employee.hist(bins=3)

#### What's the average salary in this company?

In [14]:
# your answer here
employee['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [15]:
# your answer here
employee['Salary'].max()

70

#### What's the lowest salary?

In [16]:
# your answer here
employee['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [17]:
# your answer here

employee[employee['Salary']==30]['Name']

1    Maria
2    David
Name: Name, dtype: object

#### Could you give all the information about an employee called David?

In [18]:
# your answer here
employee[employee['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you give only David's salary?

In [19]:
# your answer here
employee[employee['Name']=='David']['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate

In [20]:
# your answer here
employee[employee['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [21]:
# your answer here- 1 method
employee[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [22]:
# your answer here- 2nd method
employee.loc[:2]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees who's title is associate and the salary above 55?

In [23]:
# your answer here
employee[(employee['Title']=='associate')&(employee['Salary']>55.0)]['Name']

7    Pedro
Name: Name, dtype: object

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [24]:
# your answer here
employee_employment = employee.groupby('Years').agg({'Salary':'mean'}).reset_index()
employee_employment

   Years     Salary
0      1  35.000000
1      2  38.333333
2      3  55.000000
3      4  35.000000
4      7  60.000000
5      8  70.000000

####  What is the average Salary per title?

In [25]:
# your answer here
employee_salary = employee.groupby('Title').agg({'Salary':'mean'}).reset_index()
employee_salary

       Title     Salary
0         VP  70.000000
1    analyst  32.500000
2  associate  56.666667

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
#####  `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [26]:
# draw boxplot here

In [27]:
# print first quartile here

In [28]:
# print third quartile here

#### Is the mean salary per gender different?

In [29]:
# your answer here

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [30]:
# your answer here

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [31]:
# your answer here

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [32]:
# your answer here

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [33]:
# your answer here

In [34]:
# your answer here

####  What is the average Purchase Price?

In [35]:
# your answer here

#### What were the highest and lowest purchase prices?

In [36]:
# your answer here

In [37]:
# your answer here

#### Select all the customers we have in Spain

In [38]:
# your answer here

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [39]:
# your answer here

#### Select all the customers who have bought more than 50 items ?

In [40]:
# your answer here

#### Select orders from Spain that are above 50 items

In [41]:
# your answer here

#### Select all free orders

In [42]:
# your answer here

#### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [43]:
# your answer here

#### Select all orders that are made in 2011 and are 'lunch bag'

In [44]:
# your answer here

#### Show the frequency distribution of the amount spent in Spain.

In [45]:
# your answer here

#### Select all orders made in the month of August

In [46]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [47]:
# your answer here

#### What's the  average amount of money spent by country

In [48]:
# your answer here

#### What's the most expensive item?

In [49]:
# your answer here

#### What was the average amount spent per year ?

In [50]:
# your answer here